src/waveMakerMotionSolver/testCase/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolversFvMesh;

motionSolverLibs    ( libfloaterMotion );

solvers
{
    waveMaker
    {

        motionSolverLibs ( waveMakerMotionSolver );

        motionSolver waveMakerMotionSolver;

        times 5 ( 0 1 2 3 4 );

        pistonPositions 1 ( 5 ( 0 1 0 -1 0 ) );

        zPositions ( 0 1 );
        zScaling ( 0 1 );

        xLeft	0.5;
        xRight	3;

    //	yPiston  5 ( -2 -1 0 1 2 );
    //	positionsToLog	no;
    //	amplification	.1;
        repetitions 2;
    //	timeInterpolation	linear;
    //	spaceInterpolation	spline;
    }
/*
    waveMaker2
    {

        motionSolverLibs ( waveMakerMotionSolver );

        motionSolver waveMakerMotionSolver;

        times 3 ( 0 1 2.00001 );

        pistonPositions 1 ( 3 ( 0 .5 0 ) );

        zPositions ( -1e-10 1.0000001 );
        zScaling ( 0 1 );

        xLeft	2;
        xRight	4;

    //	yPiston  5 ( -2 -1 0 1 2 );
    //	positionsToLog	no;
    	amplification	0;
    //	repetitions	2;
    //	timeInterpolation	linear;
    //	spaceInterpolation	spline;
    }
*/
}
// ************************************************************************* //
